* 夜桜みあVALORANTエージェント化計画
:PROPERTIES:
:DATE: [2023-06-02 Fri 23:28]
:TAGS: :valorant:夜桜みあ:
:BLOG_POST_KIND: Memo
:BLOG_POST_PROGRESS: Published
:BLOG_POST_STATUS: Normal
:END:
:LOGBOOK:
CLOCK: [2023-06-02 Fri 21:40]--[2023-06-02 Fri 23:26] =>  1:46
CLOCK: [2023-06-02 Fri 18:20]--[2023-06-02 Fri 18:54] =>  0:34
CLOCK: [2023-06-02 Fri 15:24]--[2023-06-02 Fri 16:55] =>  1:31
CLOCK: [2023-06-02 Fri 12:31]--[2023-06-02 Fri 14:47] =>  2:16
CLOCK: [2023-05-28 Sun 15:00]--[2023-05-28 Sun 17:50] =>  2:50
CLOCK: [2023-05-28 Sun 12:31]--[2023-05-28 Sun 13:00] =>  0:29
CLOCK: [2023-05-28 Sun 11:38]--[2023-05-28 Sun 11:45] =>  0:07
:END:


** はじめに
みあちゃんお誕生日おめでとうございます!!!!
(この記事は[[https://twitter.com/yozakura_mia][夜桜みあ]]ちゃんの2023年度お誕生日のリスナー有志お祝い企画の参加記事です)


「夜桜みあxバトルもの」ということで、みあちゃんをVALORANTのエージェントにした場合どうなるんやろか？
というのをふと思い立ったので考えてみました。尚、思った以上に難航してしまい完成まで出来ていないのですが、一旦出来た範囲でということで...!!


又、この記事では制作過程(思考過程)に関しても纏めてあるため謎に長くなっています。最終的な結果のみ見た
い場合は、冒頭のみを見れば十分だと思います。残りは私の趣味です。

** 根本的なアイデア
「夜桜みあの世界観と性格を、"VALORANTのエージェントとして"ゲームに落とし込んだらどうなるだろうか？」
というのが根本的なアイデアです。そのため、夜桜みあの持つ世界観のみならず、VALORANTの世界に入り込んで
も違和感がないもの、というのを目指しています。

** (未)完成版: エージェント「夜桜みあ」
ロールはセンチネル。

*** シグネチャーアビリティ: キャットス
猫耳魔法のキャットス。使用すると猫耳が生え、前方左右n°ずつ(調整必要、30・30とか？)の範囲の聴力が強化
される。再使用で解除する。再使用までのクールダウンはない。

キャットス発動中は、前方以外からの音をクロネコ宅急便からの音以外ほぼ遮断する。

聴力強化範囲でオペレーターの音が鳴ると、一時的に音が一切聞こえなくなる。又、キャットス中はフラッシュ
を喰らった際の持続時間が増加する。 

発動すると、詠唱の一部が他のエージェントにも聞こえる。これは「アビリティが実行されていることを知れる
必要がある」から。

**** 使い道の例
***** 防衛時
他のアビリティを設置した後、メインに向けて発動しておくことで、進行を把握出来る。又、敵が来ているのを
把握した上でアレスを用いた壁抜きをすることも可能。(夜桜みあはアレスがすきだったため)

**** 詳細
猫耳を用いるので遠くの音まで聞こえるようになる一方、指向性が強くなるので他の範囲が聞こえなくなってい
ます。クロネコ宅急便の音は魔法で繋がっているので聞こえます。


ゲームバランス的な観点から言うと、「音」が大分重要なゲームである以上そこを強化するアビリティはコスト
も相応にしておく必要があると考えました。又、サイファーのカメラと同じように即座に使えるアビリティであ
る関係で、スキル中も周りの音が聞こえているとどこでも使えてしまい強すぎます。
そこで、視界方向以外の情報を下げることで、「目的としたエリア以外の情報を取りすぎない」「きちんと安全
確保されていない場所で使いづらくなる」というリスクを与えることを目的としています。

**** このスキルへの対策
敵がキャットスを発動している場合、安全に音を立てられる範囲が狭まります。対策としてオペレーターを先に
撃つことで一時的に無効化出来ますが、オペレーターの存在を開示する必要があります。ゆっくりとドライで上
がっていくことが一番です。

(正直、プロの試合とか見てるとドライよくあるからこれスキル弱すぎるか...?って思ったりする)

*** アビリティ: フローレ
設置型アビリティ。設置した場所に桜吹雪を起こし、その上を通るエージェントの視界を悪化させると共にスロー
効果を付与する。視界悪化はあくまでも花吹雪による物理的なものであるので、例えばレイナのウルトやヴァイ
パーウルトのように敵を強調表示するスキルには効果がない。


敵を検知して自動で発動するか、それとも手動にするか、などは今現在詰められていない。

*** アビリティ: クロネコ宅急便
設置型アビリティ。アラボ等と同じような立ち位置...なはず。


(正直最初からあるけど一番内容が決まっていない存在)

*** アルティメット: 「みあこんぐ!」/「おつみあ~!」
名前が使いたかっただけみたいな所があり...はい...どちらの名前もアルティメットぽくて良いなというので記
録を残しておきます。他スキルとシナジーのあるウルトが上手く思い付いていないので現状未実装です。ただ、
夜桜みあがヴァイパーのウルトすきらしかったので領域展開系にしたいなとは思っています(詳しくは後述) 

** ボツアイデアs
せっかくなのでボツ案を先に出しておこうと思います。

*** コンセプト: フラッシュ系スキル持ちセンチネル
既存センチネルの特徴を出してみた時、

+ サイファー → モク代わりのケージ → コントローラー寄りのセンチネル
+ チェンバー → ？？？とりあえずデュエリスト寄りのセンチネル
+ キルジョイ → モロトフ代わりのナノスワ
+ セージ → モロトフと似た役割(進行止め、顔出し阻止)のスローオーブ

といった具合に定番アビリティの「モロトフ」「モク」を持つエージェントはいるものの、フラッシュのみは持
つエージェントが存在していなかったので思い付きました。


しかしセンチネルの「足止めする必要がある」という役割を考えると、一瞬しか効果のない上に避けることので
きるフラッシュは強いアビリティとはいえないと思われます。そういうことでボツとなりました。
恐らくフラッシュ系持ちのセンチネルは実装されないんじゃなかろうか...?

*** キャットス: 聴覚情報を視覚的に表示する
猫耳による聴覚強化をどう行うか、というのを考えていた時の案の一つ。イメージとしては、サイファーやリコ
ン等のように表示する感じ。視覚的に表示するのは強そうに見えるが、慣れているプレイヤーは大体頭の中で補
完出来ている範囲の情報でしかなくて弱いかなと判断した。又、敵対した際に「新たな戦略を練る必要性」を生
み出すことが出来ないし、対策のしようがないので却下。

*** キャットス: 聴覚情報をミニマップに表示
こちらも同じく聴覚強化の案の一つ。赤点表示のようなものを考えていたが、上記とほぼ同様の理由(慣れたプ
レイヤーに恩恵はないし、敵対した際の対策が打てない)ので却下

*** フローレ: フラッシュアビリティ化
ディジーと同じように、画面にエフェクトを乗せる形での視界妨害アビリティとする案。センチネルにするとなっ
た際、センチネルとの相性が悪いので却下。(詳しくは制作過程にて)

*** フローレ: スモーク化
桜吹雪が舞うことで視界を悪化させ、進行を食い止める案。コントローラーではないので、しっかりとしたスモー
クにすることは出来ないのでそこまで進行を食い止めることが出来そうにはなく、他のアビリティ候補に遅延出
来そうなものが少ないので却下。遅延スキルとして使いたいので。

*** フローレ: 敵重火器の制圧
敵の重火器に桜を咲かせ、一定期間銃撃が行えないようにする案。今迄存在していないタイプのアビリティでは
あるが、これとKAY/Oのナイフ類を組み合わせた場合の絶望感が半端ないので却下。アビリティが使えなくとも
フィジカルで勝てる、最終的にはフィジカルが大事なゲーム性だと感じたため。


あと純粋に実装が難しそう(唐突な現実)

*** クロネコ: タレット的運用
設置型にし、敵を見付けると攻撃してくれるという案。「キルジョイとの差別化は？」という課題があるのと、
敵になった際に猫を撃つの嫌だな...という個人的感情から却下。

*** クロネコ: 索敵
スカイの犬やウィングマン的に索敵を行う案。ロールが固まりきっておらず、イニシエーターにするか悩んでい
た時の案であり、センチネルとした際に却下。

*** クロネコ: デバフ要員
「黒猫が前をよぎるとよくない」みたいな伝承から、設置された場所を敵が通るとデバフを与える、という案。
クロネコをデバフ付与系の設置アビリティにしてしまうと、エリアを見るためのアビリティが無くなっていしま
うので却下。

ちなみに個人的にはあの伝承を全く信じていないし、黒猫かわいくてすきなのでいつも「なんでそんな酷い噂を
言うの...」と思っている。

** 制作過程
なんか綺麗な流れみたいに解説を書きますが、実際の過程としては、暇があれば色々考えてメモして調べて考え
て...というのを繰り返しているので全くもってこの通りではないです。

*** 面白そうかどうかのアイデア出し
まずは、そもそもこれが面白そうかどうか？を探りたかったので難しいことを考えずにひたすらアイデアを出し
ました。一番初期に出たアイデアは以下の通りです。

**** 能力系
+ フローレ！はスモークになりそう。桜が散って目をふさぐ
+ もしくは、一種のフラッシュにも。
+ スペシャルは「みあこんぐ！」とか？
  + 「おつみあ~!」の方がかわいい説はある
  + どっちもその名前が使いたいだけ
+ キャットス(猫耳魔法)は聴覚強化に使えそう？
  + 全方位聴力強化だと強すぎるので、向いている方n°だけ強化、とか？
+ キルジョイのイメージ強いけどスカイとかも使うのでイニシもあり
  + ヴァロキャラとしてのコンセプトも大事
  + 猫耳、黒猫さんのことを考えると情報管理系？音情報に焦点を当ててみたいかも
  + そうするとフェイドが天敵になる（アストラのウルトもか）
+ 「一緒に戦うとか戦略的に戦うとかすき」とのことなので、黒猫さんをその立ち位置に置きたい
+ 黒猫さんが敵を探知するタイプのセンチ？
+ 「黒猫さんは買うものではない」ので黒猫さん関連をシグネチャアビリティにして、他は魔力を使うので購入にする…？
+ 本来は詠唱魔法だが、戦闘中に詠唱する余裕はないので即時に発動できるような魔法道具を使っている。本来何も買わなくてもいいはずなのに買うのは、その魔法道具を買っているから。

キャラクターのコンセプトを研究したい
・ソーヴァ: 発見
・セージ: 遅延
・キルジョイ:

*** VALORANTのエージェントの作り方の調査
漠然としたアイデアは出て、方向性として面白そうだなとなったのできちんと落とし込む作業に入ります。夜桜
みあのFAであると同時に、VALORANTのFAでもあるので、きちんとVALORANTにも失礼がないように&現実的である
ようにするためVALORANTのエージェントの制作過程を調べることとしました。


ここで、VALORANT公式ブログがとても役に立ちます。何故か知らないですがVALORANTは割とブログに開発陣の話
がよく載っており、マップの作成時の話やバランス調整に何を考えているのか、はたまた「[[https://playvalorant.com/ja-jp/news/dev/how-we-got-to-the-best-performing-valorant-servers-since-launch/][VALORANTがいかにし
てリリース以降最高のサーバー環境を実現したか]]」といった完全に技術屋に寄ったものまで公開されています
(個人的にすごく楽しい)。そして勿論その一環として、エージェント開発時のエピソードや解説等が一部公開さ
れているのです。


ということで、主に参考になったものについてメモを見てみましょう。

**** TODO VALORANTエージェント開発エピソード：フェイド
https://playvalorant.com/ja-jp/news/game-updates/valorant-agent-insights-fade/


イニシエーターのエージェント「フェイド」を開発する際に、どのようなことを考え、どのような理由で現在の
アビリティや特性へ至ったのかを解説している記事です。作業プロセスについては後述する資料と比べるとそこ
まで書かれていないですが、「いかにして既存エージェントと差別化したか」「どうやって立ち位置を持たせた
か」「エージェントの世界観とゲーム性をどう合わせ持たせたか」等を読み取ることが出来ます。


+ フェイドは、現状ソーヴァしかいない偵察兵を増やすために考案された
+ 「悪夢」というのはとても特徴的な「力の源」となる
+ 役割が被らない様に、「遠距離・高精度」なソーヴァに対して「近距離・局所的」なスキルを持たせた
+ コンセプトとして「賞金首狩り」を持ち、獲物を追い詰めてゆく
+ ナイトフォールの「広範囲」なアビリティは、「イニシエーターの標準的アルティメット」

**** TODO エージェントデザインの過程 // Dev Diaries - VALORANT - YouTube
[[https://www.youtube.com/watch?v=Nv09DpFkfb4][YouTube link]]

キルジョイとレイナを題材として、エージェントをデザインする際の全般的な話が聞けます。これは、実際にど
のような流れでエージェントを制作しているのかを知るのに役立ちます。例えば、最初に何を意識しているのか、
どういった事を念頭に置きながら制作しているのか、など。


***** ターゲットプレイヤーの決定
+ まずは「誰がターゲットプレイヤーなのか」を考えるところから始める。
  + 「誰が、どんな人が使いたいと思うべきなのか」 & 「何故そうなるべきなのか」
+ レイナの場合は、「キルを獲得することを楽しみ、最多キルでチームに貢献するのがすきな人」がターゲット
+ この時点では「どのようなアビリティーを持つか」を考えていない。
  
***** Roster Impactを考慮したテストプレイの実装
テストプレイの段階では、「そのエージェントが実際にゲームプレイにどのような影響を与えるのか」を考えま
す。エージェントは、「新しい展開を生み出し」たり、「新しい課題を生み出し」たり、「新しい構成を生み出
し」たりする必要があり、「使うプレイヤーが楽しいだけ」や「何かかっこいいもの」ではいけません。


キルジョイを例に取ると、セージは「遅延すること」に長けたセンチネルで、サイファーは「広範囲を管理する
こと」に長けたセンチネル。それに対し、キルジョイは「サイトを要塞化し、相手にリスクを負わせる」ことに
長けたセンチネルです。ちなみにこの動画当時、まだチェンバーはいない模様です。


同じセンチネルでも、大分異なるプレイスタイルとなるように設計されているのです。
守りつつキルを取ることが主体となります。

***** 何の「戦術ツール」を持つか？を決める: 妨害アビリティは必須
アイデンティティとなるスキルの他に、戦術ツールを持つ必要がある。
視界を塞いだりなどの敵を妨害するためのツールはどのキャラクターにも必要なものとなる。何故なら、それら
は必ず必要なアビリティとなるためそれを持たないとピックされづらくなってしまうから。

***** テストプレイをする
「ターゲットプレイヤー」に楽しんでもらえるかをテストする必要があります。ここで大切なのは、「ターゲッ
トプレイヤーではない人に気に入られる必要はない」ということです。例えば、キルジョイは計画を建ててサイ
トの要塞化を行い防衛しつつ戦うのがすきなプレイヤーをターゲットにしていますが、その人達には「沢山キル
を取りたいプレイヤー」をターゲットとするレイナは恐らく刺さらないでしょう。


テストプレイ中では、色々な変更が入ります。最初から上手くいくことはありません。

***** ゲームバランスの調整: 
ゲームバランスを調整する際は、キャラクターの強さを簡単に調整出来るようなコントロールパネルを用意して
いるようです。「キャラクターのアイデンティティを変えるのは最終手段」と言っていますが、これは恐らくア
ビリティの考え直しみたいな話をしているのかな？と思っています。


スキルのバランスは「持つスキル全体を考慮して」考えており、個々のスキル毎に考えているわけではないよう
です。

***** まとめ: 新たなエージェントを加えることの意味
新たなエージェントを加えるというのは、「新しい可能性」を追加するということ。昔ながらの爆破ゲーにある
ような「戦術ループ」は基礎としてあり、そこへ「回復」「ダッシュ」「視界を遮る」といった例外を加えるの
がvALORANT流、ということのようです。

**** パッチ5.12でのチェンバーの変更について
https://playvalorant.com/ja-jp/news/game-updates/valorant-chamber-changes-for-patch-5-12/

+ エージェント設計の原則として、「カウンタープレイ」「計画性」がある。
  + カウンタープレイは、(恐らく)そのエージェントへの対抗手段・対策手段のこと
  + 計画性は、アビリティを適当に使っていれば勝てる、みたいなのを排除すること
  + チェンバーの例では、「トレードマークの範囲制限により、敵チェンバーの位置が推測しやすくなる」など
+ 「裏取りの監視はサイファーの強みであるべきで、センチネル全員の基本性能ではありません」
+ 「エージェントのアビリティーは戦略サイクルの各段階にさまざまな影響を与えますが、アビリティーの実行
  は明確であり、敵に反撃の余地を与えるものでなければいけません」
  + 対抗手段は用意する必要がある
  + アビリティを実行していることが分かる必要がある(レイナのウルトが叫ぶのとかはそれ？)
+ チェンバーは「高精度を誇り、リスクを取ってエリアを制圧するセンチネル」というアイデンティティー
  
**** ネオン＆ゼリの共同開発秘話
https://playvalorant.com/ja-jp/news/dev/co-developing-neon-zeri/

+ 「パワーの源」という概念があり、VALORANTの場合は「テクノロジー」と「レディアント」
+ 「ネオン及びゼリが何故速いのか」を説明する「パワーの源」が必要だった

*** お断り
先程の「エージェントの作り方」で得た知識を元に、「実際に存在しうるようなエージェント」に仕立てる作業
をするわけですが、本来のエージェントを作る順序とは大きく異なり

+ 先にエージェントの人物像が存在する
+ ある程度スキルとして使いたいもの(魔法等)が存在する

という条件が存在しています。そのため、ある程度の制約と妥協(「力の源」の定義や、スキルと人物像とのマッ
チ具合等)は行う必要があります。(優先順位的に、"夜桜みあであること"が最上位であるため)

*** ターゲットプレイヤー・コンセプトを決める
まずは、「どういったプレイを好む人に使われてほしいのか」ということを考える必要があります。これに関し
ては、「夜桜みあを実装したい」という目的上「夜桜みあに使われてほしい」ということになります。しかしそ
れだとペルソナとしては曖昧すぎるので、具体的に「どういったプレイスタイルを好んでいるか」を推測してい
く必要があります。

**** プレイスタイルの推測: ピックデータ
雰囲気や後述する言動からどういうエージェントを使っているかは分かるものの、せっかくなのできちんとデータが取りたい...と
いうことで、今迄のVALORANT配信で使われている(or 「使える」と言っている)エージェントを調べた結果がこれです。


補足:

+ 本来、時系列上の変化も考慮するべきですが、 +やりかたよく分からない+ ちょっとそこまでやるのはやりすぎな気がするのでやりません
+ 合わせピックか否かも考慮しようとしましたが、どちらにせよピックプールは一定だったので考慮せずとも良いと判断しました。
+ サンプル数が少ないため、ランク・アンレ双方混ぜて集計しています。
+ [[https://www.youtube.com/watch?v=BDGYmgotBy4][フラッシュ縛りの回]]は除外しています。
+ 統計学んだはずだけど苦手分野なのできちんと意味のあるデータになっていない可能性があります、ユルシテ。

#+NAME: 配信上のエージェントピック
| エージェント | ロール         | ピック数 |
|--------------+----------------+----------|
| キルジョイ   | センチネル     |        8 |
| セージ       | センチネル     |        6 |
| スカイ       | イニシエーター |        1 |
| ヴァイパー   | コントローラー |        1 |
| レイズ       |                |        1 |


#+NAME: ピックプール
| マップ       | セージ | キルジョイ | スカイ | ヴァイパー |
|--------------+--------+------------+--------+------------|
| フラクチャー |        | x          | x      | x          |
| スプリット   | x      |            |        |            |
| バインド     | x      | x          |        |            |
| ブリーズ     | x      |            |        |            |

これより、データからも圧倒的にキルジョイが多用されており、センチネルがメインであることが分かります。

***** データソース
+ [[https://www.youtube.com/watch?v=j7YSVkeDQcc][【#VALORANT女子】#み♡も は戦場でお茶会をします（？）【Vtuber】 - YouTube]]
  + Fracture(スカイ), Split(セージ)
+ [[https://www.youtube.com/watch?v=0PiBto5cMH8][【VALORANT】はじめてのソロ…！🔫爆弾のおつかいをします【Vtuber】 - YouTube]]
  + Icebox(ヴァイパー), Haven(キルジョイ)
+ [[https://www.youtube.com/watch?v=nrKoFExkQTE][【VALORANT】じょしヴァロラント♡みあおぢさんが武器買ってあげちゃおうね…【#Vtuber】 - YouTube]]
  + Bind(キルジョイ), Fracture(キルジョイ), ブリーズ(セージ)
+ [[https://www.youtube.com/watch?v=TEs3Erk6DyQ][【VALORANT】配信で初めてのヴァロ！！フルパで臨みます…！【Vtuber】 - YouTube]]
  + Bind(キルジョイ)、 Icebox(キルジョイ), Fracture(セージ)
+ [[https://www.youtube.com/watch?v=Gai4AE9IB0g][【VALORANT】~うぇーいヴァロラントアンレ！~【魂のソウル】 - YouTube]] (本人枠なし)
  + Bind(セージ), Accent(レイズ), Haven(セージ), Accent(キルジョイ)
+ [[https://www.youtube.com/watch?v=h2tOU36GWvk][【VALORANT】~フルパヴァロラントうぃずそらいろのふたり~【魂のソウル】【夜桜みあ】【裏咲無形】【夢河かのん】【踊場そよぎ】 - YouTube]]
  + [2022-01-11 Tue]
  + TODO ブリーズ(キルジョイ), Accent(キルジョイ), Fracture(セージ)

**** プレイスタイルの推測: 雑談より
[[https://youtu.be/iP0eZqrorZc?t=3650][#み♡も マシュマロ雑談企画]] ですきなロールに関する話がいくつか聞けます。「キルジョイがすき」「センチネ
ルが全体的にすき」「元々、何かと一緒に戦うのとか戦略的に戦うとかがすき」という発言があるのは大分参考
になります。


ゴリ押しヴァイパーウルトで領域展開するのがすきらしい。「呼んでくれたらセンチネルかデュエやるよ!」と
言っていたり、「イニシも若干使う」と言っていたり、なんだかんだ色々使いはするらしい。なるほど。

**** 結論
上記のデータより、

+ 戦略的に戦うのがすき
+ 何かと一緒に戦うのがすき
+ ゴリ押し領域展開がすき

ということがわかります。正直これだとまだセンチネルという枠組み以上に絞り込むことは難しい(ゴリ押し領
域展開だけは特徴として出ているけれども)です。もう少し色々な配信を見直したりプレイスタイルの観察等す
ればよかったのですが、 +流石に気持ち悪い気がする+ そこまでの時間がないので、ここから先は自由に決定出
来るものとすることにしました。

*** VALORANT視点でコンセプトを決める
立ち回りについて自由に決定出来るといわれても困るので(オープンクエスチョンが苦手)、ここはVALORANT側の
視点から考えてみます。


「エージェントデザインの過程」の動画によると、新しく追加されるエージェントは、「現在の環境に何かする」
必要があります。動画では、「新しい展開を生み出し」たり、「新しい課題を生み出し」たり、「新しい構成を
生み出し」たり等が例示されていました。そこで、既存のセンチネルの分析をし、現状存在していないコンセプ
トが何か無いかを探っていくことにします。

**** エージェントの分析: 戦術ツールの視点から
「エージェントデザインの過程」によると、各エージェントは戦術ツールを持つ必要があります。ここでの戦術
ツールは、具体的に明示されていませんでしたが、恐らくCSGOでいうところのフラッシュ・モク・モロトフ等に
値するスキルのことだと考えられます。

***** キルジョイ(モロトフ系)
ナノスワームがモロトフの役割を果たしています。これは、相手の侵入を防ぎ、時間を稼ぐのに良いツールだと
思われます。又、攻撃側の際は解除阻止にも使えるやつですね。

***** サイファー(モク系)
サイバーケージをモク代わりに使うことが出来ます。上手い人のプレイをたまに見ると、ケージを上手く使って
射線を変えるなどの立ち回りをしたりすることがよくあります。

***** セージ(モロト...フ...?)
よく考えたらよく分かんなくなってきた。足止めスキルとして持つスローオーブがまさに戦術ツールであり、相
手の居場所を限定して入ってこれなくするという観点からモロトフ系と同様な役割を持っているように思われま
す。

***** チェンバー(？？？)
こいつ何...??

**** エージェントの分析: 想定されている立ち回り
***** キルジョイ: 籠城して守る
サイト中を徹底して
***** サイファー: 情報収集・裏取り警戒
「パッチ5.12でのチェンバーの変更について」にて「裏取りの監視はサイファーの強みであるべき」と書かれて
おり、攻撃時は
***** セージ: ひたすらに遅延
壁を建てるのもスローオーブも遅延用途。ヒールオーブも蘇生も「遅延要員を倒させない」という面で遅延用ス
キルと考えられます。情報を取ったり、サイト中で耐えるという動きは仕辛いけれどその分「侵入されるまでの
遅延をする」のが役割なのではないかなと考えています。

***** チェンバー: 安全なワンピック
「パッチ5.12でのチェンバーの変更について」にて「高精度を誇り、リスクを取ってエリアを制圧するセンチネ
ル」というアイデンティティであるとの記述があります。

基本的には「生きのこること」が大切となるセンチネルに於いて、ハイリスクを冒すのは難しいように思うもの
の、そこをランデブーで補完しているんでしょうね。
**** エージェントの分析: ○○寄りのセンチネル
割と区分として、

*** センチネルにふさわしいスキルセットとは？
**** センチネルの特徴: 状態異常系スキルを持つ
あらためて考えてみると、センチネルは必ず状態異常を付与するアビリティを所持しています。セージはスロー
オーブ、キルジョイはアラームボット、チェンバーはトレードマークとツール・ド・フォース、サイファーはト
ラップワイヤーです。


ここからは推測ですが、センチネルの役割の一つに「ラッシュを止める」というものがある関係で「状態異常に
させることでエントリーしづらくさせる」という目的があるのではないかなと考えられます。

**** 「センチネル」の役回りから考える、必要な能力

*** TODO カウンタープレイの実装
まだできてない。

*** スキルの価格帯設定
** TODO おわりに
おわりなので、本題とはちょっと離れた話をします。オフトピってﾔﾂ。


実は企画を聞いた当初は、普通に絵を書こうとしていました。バトルもの、ということでみあちゃんが良くやっ
ているゲームと組み合わせるか~~？？と思っていたのですが、最近よくやっているらしいApexは本家やっていな
くてよくわからんのでVALORANTを選択しました。でも絵が壊滅的にダメ(1年に1回しか描かないのでそれはそう)
で、行き詰まってしまい...色々悩んでいた時にこのアイデアが降ってきたので取り掛かってみた次第です。


ちなみに途中でアレス(夜桜みあがよく持つ武器)のスキンを考えようともしていましたが、そちらもデザインセ
ンスが間に合いませんでしたgg。


エージェント化の話に戻すと。5/21あたりに夢からアイデアを貰い突発的に考え始め(実は[[https://twitter.com/cj_bc_sd/status/1660042761163378688][このツイート]]がそう)、
「や~!おもしろそうだな!!色々アイデア浮かんだし!!!できそう!!!!」とかナメてかかったわけですが、見事に
間に合いませんでした...アイデハは浮かんでも、きちんと作ろうとするとボツになることの繰り返し...バラン
ス考えたりキャラ被り考えたりするのって難しいですね。本職の人やっぱすげぇや... 


て、そうではなくて。や、そう("本職の人すごい")ではあるんですけど。色々考えること多くて、実は大分焦っ
て纏めた本文なのですけどとても楽しかったです。きちんと作り込めなくて悔しさは大分ある...リベンジした
い。


ちなみに作業中に大分色々なエージェントについて理解が深まったりしたのでとても楽しかったです。まぁ完全
に趣味みたいなことしてるのをFAちゅてええのか...?感はあるけど、お絵描きすきな人がお絵描きでFA作るのと
同じ感覚なので許されるやろ、しらんけど、という感情でいます。

** 参考資料
+ [[id:53c89468-dc7d-4597-a068-95112d654d46][エージェントデザインの過程 -- VALORANT]]

*** 夜桜みあの統計
**** エージェントピック
本来なら時系列を考慮したりするべきではありますが、正直統計は苦手なので

+ [[https://youtu.be/0PiBto5cMH8?t=1081][2022/06/17 - 18:01]] モクはヴァイパーしか出来ない


***** その他喋っていたこと
***** 生データ

**** マップ
| マップ         | 得意下手 | 使うエージェント       | 情報日時         |
|----------------+----------+------------------------+------------------|
| アイスボックス | 苦手     | キルジョイ・ヴァイパー | [2022-06-17 Fri] |
|                |          |                        |                  |

モクはヴァイパーのみ
*** 夜桜みあ・のあ情報
**** 魔法: キャットス
猫耳を生やす魔法。猫耳を生やすことしか分かっていない。

1:11:46
https://www.youtube.com/watch?v=l9nmg9zMDBA&t=4168s


#+begin_quote
夜空に舞う妖精よ 音を奏でるハープよ
かわいいを創造し
<不明瞭区間>
姿を変えん
キャットス
#+end_quote

**** 魔法: フローレ
桜を咲かせる魔法。一応長文詠唱が存在するが、割と「フローレ!」だけでも詠唱は可能らしい。


**** 黒猫
リスナーの呼称。

**** 杖
あくまでもアクセサリーとしての存在であり、杖がなくとも詠唱で魔法が使える。ハープの部分は一応音が鳴る。

夜桜みあ曰く杖は重いらしい。コントローラーよりか重い。それはとても重いな。うん。

1:15:14
https://www.youtube.com/watch?v=l9nmg9zMDBA&t=4168s

*** Valorantの統計
**** スキルの価格帯
マダデキテナイ...orz

